Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: |usr_22.txt| Finding the file to edit |22.1| The file explorer |22.2| The current directory |22.3| Finding a file |22.4| The buffer list
es_es: |usr_22.esx| Encontrar el archivo a editar |22.1| El explorador de archivos |22.2| El directorio actual |22.3| Encontrar un archivo |22.4| La lista de búfers

source: |usr_23.txt| Editing other files |23.1| DOS, Mac and Unix files |23.2| Files on the internet |23.3| Encryption |23.4| Binary files |23.5| Compressed files
es_es: |usr_23.esx| Editar otros archivos |23.1| Archivos de DOS, Mac y Unix |23.2| Archivos en Internet |23.3| Cifrado |23.4| Archivos binarios |23.5| Archivos comprimidos

source: |usr_24.txt| Inserting quickly |24.1| Making corrections |24.2| Showing matches |24.3| Completion |24.4| Repeating an insert |24.5| Copying from another line |24.6| Inserting a register |24.7| Abbreviations |24.8| Entering special characters |24.9| Digraphs |24.10| Normal mode commands
es_es: |usr_24.esx| Insertar con rapidez |24.1| Corregir | 24.2| Mostrar coincidencias |24.3| Autocompletado |24.4| Repetir una inserción |24.5| Copiar desde otra línea |24.6| Insertar un registro |24.7| Abreviaturas |24.8| Introducir caracteres especiales |24.9| Dígrafos |24.10| Órdenes del modo Normal

source: |usr_25.txt| Editing formatted text |25.1| Breaking lines |25.2| Aligning text |25.3| Indents and tabs |25.4| Dealing with long lines |25.5| Editing tables
es_es: |usr_25.txt| Editar texto con formato |25.1| Dividir líneas |25.2| Alinear texto |25.3| Sangrado y tabulación |25.4| Tratar líneas largas |25.5| Editar tablas

source: |usr_26.txt| Repeating |26.1| Repeating with Visual mode |26.2| Add and subtract |26.3| Making a change in many files |26.4| Using Vim from a shell script
es_es: |usr_26.txt| Repetición |26.1| Repetir en modo Visual |26.2| Sumar y restar |26.3| Realizar un cambio en varios archivos |26.4| Usar Vim desde un script de intérprete de órdenes

source: |usr_27.txt| Search commands and patterns |27.1| Ignoring case |27.2| Wrapping around the file end |27.3| Offsets |27.4| Matching multiple times |27.5| Alternatives |27.6| Character ranges |27.7| Character classes |27.8| Matching a line break |27.9| Examples
es_es: |usr_27.esx| Órdenes y patrones de búsqueda |27.1| Ignorar la distinción entre mayúsculas y minúsculas |27.2| Justificar el fin del archivo |27.3| Dirección relativa («offsets») |27.4| Emparejar varios elementos |27.5| Alternativas |27.6| Rangos de caracteres |27.7| Clases de caracteres |27.8| Coincidir con un salto de línea |27.9| Ejemplos

source: |usr_28.txt| Folding |28.1| What is folding? |28.2| Manual folding |28.3| Working with folds |28.4| Saving and restoring folds |28.5| Folding by indent |28.6| Folding with markers |28.7| Folding by syntax |28.8| Folding by expression |28.9| Folding unchanged lines |28.10| Which fold method to use?
es_es: |usr_28.txt| Plegar |28.1| ¿Qué es plegar? |28.2| Plegar manualmente |28.3| Trabajar con pliegues |28.4| Guardar y restaurar pliegues |28.5| Plegar por sangrado |28.6| Plegar con marcadores |28.7| Plegar por sintaxis |28.8| Plegar por expresión |28.9| Plegar líneas sin cambios |28.10¿| ¿Qué método de plegar debería usar?

source: |usr_29.txt| Moving through programs |29.1| Using tags |29.2| The preview window |29.3| Moving through a program |29.4| Finding global identifiers |29.5| Finding local identifiers
es_es: |usr_29.txt| Moverse a través de programas |29.1| Usar etiquetas |29.2| La ventana de previsualización |29.3| Moverse a través de un programa |29.4| Buscar identificadores globales |29.5| Buscar identificadores locales

source: |usr_30.txt| Editing programs |30.1| Compiling |30.2| Indenting C files |30.3| Automatic indenting |30.4| Other indenting |30.5| Tabs and spaces |30.6| Formatting comments
es_es: |usr_30.txt| Editar programas |30.1| Compilar |30.2| Sangrado en archivos C |30.3| Sangrado automático |30.4| Otros sangrados |30.5| Tabulados y espacios |30.6| Formatear comentarios

source: |usr_31.txt| Exploiting the GUI |31.1| The file browser |31.2| Confirmation |31.3| Menu shortcuts |31.4| Vim window position and size |31.5| Various
es_es: |usr_31.txt| Sacar partido a la interfaz gráfica |31.1| El explorador de archivos |31.2| Confirmación |31.3| Atajos de teclado para menús |31.4| Posición y tamaño de la ventana de Vim |31.5| Varios

source: |usr_32.txt| The undo tree |32.1| Undo up to a file write |32.2| Numbering changes |32.3| Jumping around the tree |32.4| Time travelling
es_es: |usr_32.txt| El árbol de deshacer |32.1|Volver a un punto de edición anterior |32.2|Numerar los cambios |32.3|Desplazarse en el árbol |32.4|Viajar en el tiempo

source: |usr_40.txt| Make new commands |40.1| Key mapping |40.2| Defining command-line commands |40.3| Autocommands
es_es: |usr_40.txt| Crear órdenes nuevas |40.1|Macros de teclado |40.2|Definir órdenes de línea de órdenes |40.3|Órdenes automáticas

source: |usr_41.txt| Write a Vim script |41.1| Introduction |41.2| Variables |41.3| Expressions |41.4| Conditionals |41.5| Executing an expression |41.6| Using functions |41.7| Defining a function |41.8| Lists and Dictionaries |41.9| Exceptions |41.10| Various remarks |41.11| Writing a plugin |41.12| Writing a filetype plugin |41.13| Writing a compiler plugin |41.14| Writing a plugin that loads quickly |41.15| Writing library scripts |41.16| Distributing Vim scripts
es_es: |usr_41.txt| Escribir scripts para Vim |41.1| Introducción |41.2| Variables |41.3| Expresiones |41.4| Estructuras de decisión |41.5| Ejecución de expresiones |41.6| Funciones |41.7| Definición de funciones |41.8| Listas y Diccionarios |41.9| Excepciones |41.10| Observaciones |41.11| Escribir extensiones |41.12| Escribir extensiones para tipo de archivo |41.13| Escribir extensiones para compiladores |41.14| Escribir extensiones que carguen rápidamente |41.15| Escribir bibliotecas |41.16| Distribuir scripts de Vim

source: *usr_06.txt* For Vim version 7.3. Last change: 2009 Oct 28
es_es: *usr_06.esx* Para Vim version 7.3. Último cambio: 24/5/2006

source: Using syntax highlighting
es_es: Uso del resaltado de sintaxis

source: Black and white text is boring. With colors your file comes to life. This not only looks nice, it also speeds up your work. Change the colors used for the different sorts of text. Print your text, with the colors you see on the screen.
es_es: El texto en blanco y negro es aburrido. Con colores los archivos tienen más vida. No sólo adquieren mejor apariencia, si no que acelera la producción. Cambie los colores para distintos tipos de texto. Imprima sus textos con los colores que ve en pantalla.

source: |06.1| Switching it on |06.2| No or wrong colors? |06.3| Different colors |06.4| With colors or without colors |06.5| Printing with colors |06.6| Further reading
es_es: |06.1| Activar |06.2| ¿Colores incorrectos o ausentes? |06.3| Diferentes colores |06.4| Con colores o sin colores |06.5| Imprimir con colores |06.6| Más información

source: Next chapter: |usr_07.txt| Editing more than one file Previous chapter: |usr_05.txt| Set your settings Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_07.esx| Editar más de un archivo Capítulo anterior: |usr_05.esx| Configuración Tabla de contenidos: |usr_toc.esx|

source: *06.1* Switching it on
es_es: *06.1* Activar

source: That should work in most situations to get color in your files. Vim will automagically detect the type of file and load the right syntax highlighting. Suddenly comments are blue, keywords brown and strings red. This makes it easy to overview the file. After a while you will find that black&white text slows you down!
es_es: Esto debería funcionar en la mayoría de las situaciones para obtener el coloreado. Vim detectará automágicamente el tipo de archivo y cargará la sintaxis correspondiente. De repente, los comentarios, las palabras clave y las cadenas se colorean. Esto facilita una vista general del archivo. ¡Tras usarlo un poco se dará cuenta de lo que le ralentizaba la edición el blanco y negro!

source: *06.2* No or wrong colors?
es_es: *06.2* ¿Colores incorrectos o ausentes?

source: - Your terminal does not support colors. Vim will use bold, italic and underlined text, but this doesn't look very nice. You probably will want to try to get a terminal with colors. For Unix, I recommend the xterm from the XFree86 project: |xfree-xterm|.
es_es: - Su terminal no soporta colores. Vim usará negrita, itálica y texto subrayado, pero esto no es muy agradable. Probablemente quiera probar una terminal con colores. Para Unix, se recomienda usar la xterm del proyecto XFree86: |xfree-xterm|.

source: - Your terminal does support colors, but Vim doesn't know this. Make sure your $TERM setting is correct. For example, when using an xterm that supports colors: >
es_es: - Su terminal soporta colores, pero Vim no lo sabe. Asegúrese de que la variable $TERM es correcta. Por ejemplo, cuando use una xterm que soporte colores: >

source: setenv TERM xterm-color < or (depending on your shell): >
es_es: setenv TERM xterm-color < o (dependiendo de su consola): >

source: < The terminal name must match the terminal you are using. If it still doesn't work, have a look at |xterm-color|, which shows a few ways to make Vim display colors (not only for an xterm).
es_es: < El nombre de la terminal debe coincidir con la terminal que esté usando. Si aún así no funciona, consulte |xterm-color|, donde puede ver unas cuantas maneras de hacer que se vean colores.

source: - The file type is not recognized. Vim doesn't know all file types, and sometimes it's near to impossible to tell what language a file uses. Try this command: >
es_es: - El tipo de archivo no es reconocido. Vim no conoce todos los tipos de archivos, y a veces es casi imposible decir que lenguaje usa un archivo. Pruebe esta orden: >

source: :set filetype < If the result is "filetype=" then the problem is indeed that Vim doesn't know what type of file this is. You can set the type manually: >
es_es: :set filetype < Si el resultado es «filetype=» entonces el problema es que Vim no sabe que de qué tipo de archivo se trata. Puede decirle el tipo de archivo de forma manual: >

source: < To see which types are available, look in the directory $VIMRUNTIME/syntax. For the GUI you can use the Syntax menu. Setting the filetype can also be done with a |modeline|, so that the file will be highlighted each time you edit it. For example, this line can be used in a Makefile (put it near the start or end of the file): >
es_es: < Para ver qué tipos de archivos están disponibles, mire en el directorio «$VIMRUNTIME/syntax». Para la GUI puede usar el menú Syntax. También puede activar el tipo de archivo con un |modeline|, de forma que el archivo se resaltará cada vez que lo edite. Por ejemplo, puede emplear esta línea para los Makefiles (insértela cerca del principio o el final del archivo): >

source: < You might know how to detect the file type yourself. Often the file name extension (after the dot) can be used. See |new-filetype| for how to tell Vim to detect that file type.
es_es: < Quizá sepa cómo detectar el tipo de archivo por cuenta propia. A menudo se puede emplear la extensión del nombre de archivo. Véase |new-filetype| para ver cómo decirle a Vim que detecte el tipo.

source: - There is no highlighting for your file type. You could try using a similar file type by manually setting it as mentioned above. If that isn't good enough, you can write your own syntax file, see |mysyntaxfile|.
es_es: - No hay resaltado para su tipo de archivo. Puede intentar usar un archivo similar activándolo manualmente como se explica más arriba. Si no tiene suficiente, puede escribir su propio archivo de sintaxis, consulte |mysyntaxfile|.

source: - The colored text is very hard to read. Vim guesses the background color that you are using. If it is black (or another dark color) it will use light colors for text. If it is white (or another light color) it will use dark colors for text. If Vim guessed wrong the text will be hard to read. To solve this, set the 'background' option. For a dark background: >
es_es: - El texto coloreado es muy difícil de leer. Vim trata de averiguar el color de fondo que está usando. Si es negro (u otro color oscuro) usará colores claros para el texto. Si es blanco (u otro color claro) usará colores oscuros para el texto. Si Vim no ha acertado, el texto se hará difícil de leer. Para solucionar esto, active la opción 'background'. Para un fondo oscuro: >

source: < And for a light background: >
es_es: < Y para un fondo claro: >

source: < Make sure you put this _before_ the ":syntax enable" command, otherwise the colors will already have been set. You could do ":syntax reset" after setting 'background' to make Vim set the default colors again.
es_es: < Asegúrese de que lo pone _antes_ de «:syntax enable», en caso contrario, los colores ya se habrán definido. Puede hacer «:syntax reset» tras activar 'background' para hacer que Vim vuelva a redefinir los colores.

source: *06.3* Different colors *:syn-default-override*
es_es: *06.3* Diferentes colores *:syn-default-override*

source: If you don't like the default colors, you can select another color scheme. In the GUI use the Edit/Color Scheme menu. You can also type the command: >
es_es: Si no le gustan los colores predeterminados, puede seleccionar otro esquema de colores. En GVim, use el menú Edit/Color. También puede usar la orden: >

source: "evening" is the name of the color scheme. There are several others you might want to try out. Look in the directory $VIMRUNTIME/colors.
es_es: «evening» es el nombre del esquema de colores. Hay muchos otros que quizá quiera probar. Mire en el directorio «$MYVIMRUNTIME/colors».

source: You could also write your own color scheme. This is how you do it:
es_es: También puede escribir su propio esquema de colores. Así es que como se hace:

source: 1. Select a color scheme that comes close. Copy this file to your own Vim directory. For Unix, this should work: >
es_es: 1. Seleccione un esquema que se parezca. Copie ese archivo a su propio directorio de Vim. Bajo Unix, esto debería funcionar: >

source: !mkdir ~/.vim/colors !cp $VIMRUNTIME/colors/morning.vim ~/.vim/colors/mine.vim < This is done from Vim, because it knows the value of $VIMRUNTIME.
es_es: !mkdir ~/.vim/colors !cp $VIMRUNTIME/colors/morning.vim ~/.vim/colors/mine.vim < Esto se hace desde Vim, porque conoce el valor de $VIMRUNTIME.

source: 2. Edit the color scheme file. These entries are useful:
es_es: 2. Editar el archivo del esquema de colores. Estas entradas son útiles:

source: term attributes in a B&W terminal cterm attributes in a color terminal ctermfg foreground color in a color terminal ctermbg background color in a color terminal gui attributes in the GUI guifg foreground color in the GUI guibg background color in the GUI
es_es: term atributos en una terminal B/N cterm atributos en una terminal a color ctermfg color frontal de una terminal a color ctermbg color de fondo de una terminal a color gui atributos de la GUI guifg color frontal de la GUI guibg color de fondo de la GUI

source: For example, to make comments green: >
es_es: Por ejemplo, para hacer los comentarios en verde: >

source: :highlight Comment ctermfg=green guifg=green < Attributes you can use for "cterm" and "gui" are "bold" and "underline". If you want both, use "bold,underline". For details see the |:highlight| command.
es_es: :highlight Comment ctermfg=green guifg=green < Los atributos que puede usar para «cterm» y «gui» son «bold» y «underline». Si quiere los dos, escriba «bold,underline». Para más detalles, consulte la orden |:highlight|.

source: 3. Tell Vim to always use your color scheme. Put this line in your |vimrc|: >
es_es: 3. Decir a Vim que use siempre su esquema. Incluya esto en su |vimrc|: >

source: You will see text in various color combinations. You can check which ones are readable and look nice.
es_es: Verá texto en varias combinaciones de colores. Puede comprobar cuáles son legibles y que tienen un apariencia agradable.

source: *06.4* With colors or without colors
es_es: *06.4* Con colores o sin colores

source: Displaying text in color takes a lot of effort. If you find the displaying too slow, you might want to disable syntax highlighting for a moment: >
es_es: Mostrar texto en color conlleva un gran uso del procesador. Si le parece que el texto se muestra muy lentamente, puede desactivar el resaltado momentáneamente: >

source: *:syn-off* If you want to stop highlighting completely use: >
es_es: *:syn-off* Si quiere desactivar el resaltado por completo use: >

source: *:syn-manual* If you want syntax highlighting only for specific files, use this: >
es_es: *:syn-manual* Si desea resaltado de sintaxis sólo para archivos específicos, use esto: >

source: This will enable the syntax highlighting, but not switch it on automatically when starting to edit a buffer. To switch highlighting on for the current buffer, set the 'syntax' option: >
es_es: Esto permitirá el resaltado, pero no lo activará automáticamente cuando edites un búfer. Para activarla en el búfer actual, asigne la opción 'syntax' del siguiente modo: >

source: *06.5* Printing with colors *syntax-printing*
es_es: *06.5* Imprimir con colores *syntax-printing*

source: You will get the usual printer dialog, where you can select the printer and a few settings. If you have a color printer, the paper output should look the same as what you see inside Vim. But when you use a dark background the colors will be adjusted to look good on white paper.
es_es: Le aparecerá el típico diálogo de impresora, donde puede seleccionarla junto con algunas opciones. Si tiene una impresora a color, la salida impresa debe ser similar a lo que aparece en pantalla. Sin embargo, cuando tiene un fondo oscuro, los colores se ajustarán para verse bien sobre blanco.

source: There are several options that change the way Vim prints: 'printdevice' 'printheader' 'printfont' 'printoptions'
es_es: Hay diversas opciones que modifican el modo en el que Vim imprime: 'printdevice' 'printheader' 'printfont' 'printoptions'

source: "v" starts Visual mode. "100j" moves a hundred lines down, they will be highlighted. Then ":hardcopy" will print those lines. You can use other commands to move in Visual mode, of course.
es_es: «v» inicia el modo Visual. «100j» le mueve 100 líneas hacia abajo, que se resaltarán. Por último «:hardcopy» imprimirá las líneas destacadas. Puede usar otras órdenes para moverse en modo Visual, por supuesto.

source: This also works on Unix, if you have a PostScript printer. Otherwise, you will have to do a bit more work. You need to convert the text to HTML first, and then print it from a web browser.
es_es: Esto también funciona en Unix si tiene una impresora PostScript. En caso contrario, tendrá que hacer un poco más de trabajo. Tendrá que convertir a HTML primero y luego imprimirlo desde un navegador web.

source: You will see it crunching away, this can take quite a while for a large file. Some time later another window shows the HTML code. Now write this somewhere (doesn't matter where, you throw it away later): > :write main.c.html
es_es: Lo verá trabajar, esto puede llevar un buen tiempo para archivos grandes. Un rato después otra ventana muestra el código HTML. Ahora guarde esto en algún lugar (no importa dónde, lo eliminará en cuanto termine de imprimir): > :write main.c.html

source: Open this file in your favorite browser and print it from there. If all goes well, the output should look exactly as it does in Vim. See |2html.vim| for details. Don't forget to delete the HTML file when you are done with it.
es_es: Abra este archivo en su navegador favorito e imprímalo desde allí. Si todo ha salido bien, la salida debe tener la misma apariencia que tenía en Vim. Véase |2html.vim| para más detalles. No se olvide de eliminar el archivo HTML.

source: *06.6* Further reading
es_es: *06.6* Más información

source: |usr_44.txt| Your own syntax highlighted. |syntax| All the details.
es_es: |usr_44.txt| Su propio resaltado de sintaxis. |syntax| Todos los detalles.

source: *usr_12.txt* For Vim version 7.3. Last change: 2007 May 11
es_es: *usr_12.esx* Para Vim versión 7.3. Último cambio: 11/6/2007

source: Clever tricks
es_es: Trucos

source: By combining several commands you can make Vim do nearly everything. In this chapter a number of useful combinations will be presented. This uses the commands introduced in the previous chapters and a few more.
es_es: Puedes conseguir que Vim haga casi cualquier cosa,.mediante la combinación varias órdenes. En este capítulo, presentaremos una serie de combinaciones útiles. Esto emplea las órdenes introducidos en capítulos anteriores y algunos más.

source: |12.1| Replace a word |12.2| Change "Last, First" to "First Last" |12.3| Sort a list |12.4| Reverse line order |12.5| Count words |12.6| Find a man page |12.7| Trim blanks |12.8| Find where a word is used
es_es: |12.1| Reemplazar una palabra |12.2| Cambiar «Último, Primero» a «Primero Último» |12.3| Ordenar una lista |12.4| Invertir el orden de las líneas |12.5| Contar palabras |12.6| Encontrar una página de manual |12.7| Eliminar espacios en blanco sobrantes |12.8| Buscar dónde se emplea una palabra

source: Next chapter: |usr_20.txt| Typing command-line commands quickly Previous chapter: |usr_11.txt| Recovering from a crash Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_20.esx| Ser eficaz con la línea de órdenes Capítulo anterior: |usr_11.esx| Recuperarse de un fallo Tabla de contenidos: |usr_toc.esx|

source: *12.1* Replace a word
es_es: *12.1* Reemplazar una palabra

source: :%s/four/4/g
es_es: :%s/cuatro/4/g

source: :%s/\<four/4/g
es_es: :%s/\<cuatro/4/g

source: Obviously, this still goes wrong on "fourteen". Use "\>" to match the end of a word: >
es_es: Obviamente, esto también funcionará mal con «cuatrocientos». Use «\>» para concordar el final de una palabra: >

source: :%s/\<four\>/4/g
es_es: :%s/\<cuatro\>/4/g

source: If you are programming, you might want to replace "four" in comments, but not in the code. Since this is difficult to specify, add the "c" flag to have the substitute command prompt you for each replacement: >
es_es: Si está programando, quizá desee reemplazar «cuatro» en los comentarios, pero no en el código. Ya que es difícil de especificar, añada la opción «c» para que se le pida una confirmación cada vez que se vaya a reemplazar la palabra: >

source: :%s/\<four\>/4/gc
es_es: :%s/\<cuatro\>/4/gc

source: Suppose you want to replace a word in more than one file. You could edit each file and type the command manually. It's a lot faster to use record and playback. Let's assume you have a directory with C++ files, all ending in ".cpp". There is a function called "GetResp" that you want to rename to "GetAnswer".
es_es: Suponga que quiere reemplazar una palabra en más de un archivo. Puede editar cada archivo y escribir la orden manualmente. Es mucho más fácil usar la grabación y reproducción. Vamos a suponer que tiene un directorio con archivos C++ en el que todos terminan en «.cpp». Quiere renombrar la función «GetResp» a «GetAnswer».

source: At the last file you will get an error message, because ":wnext" cannot move to the next file. This stops the execution, and everything is done.
es_es: En el último archivo obtendrá un mensaje de error, porque «wnext» no puede ir a un archivo siguiente. Esto parará la ejecución y todo terminará.

source: Note: When playing back a recorded sequence, an error stops the execution. Therefore, make sure you don't get an error message when recording.
es_es: Nota: Cuando vuelva a reproducir una secuencia grabada, un error detendrá la ejecución. Cuide de no producir errores cuando grabes.
